html/xv6/os.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>操作系统</title>
<meta name="author" content="Wu, Shanliang" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="xv6.html"> UP </a>
 |
 <a accesskey="H" href="xv6.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">操作系统</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org4e6e85f">什么是操作系统？</a>
<ul>
<li><a href="#org7725f26">内核</a></li>
</ul>
</li>
<li><a href="#org05dfac3">操作系统的目的</a>
<ul>
<li><a href="#org1783e81">高效vs易用</a></li>
<li><a href="#org67d6903">强大vs简单</a></li>
<li><a href="#orgc8d61fe">灵活vs安全</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org4e6e85f" class="outline-2">
<h2 id="org4e6e85f">什么是操作系统？</h2>
<div class="outline-text-2" id="text-org4e6e85f">
<ul class="org-ul">
<li>硬件：CPU、RAM、硬盘、网络等</li>
<li>OS:
<ul class="org-ul">
<li>内核服务：如文件系统（FS）、进程、内存、网络等</li>
<li>系统调用</li>
</ul></li>
<li>用户应用：如shell（sh）、编译器（cc）、数据库（DB）等</li>
</ul>
</div>
<div id="outline-container-org7725f26" class="outline-3">
<h3 id="org7725f26">内核</h3>
<div class="outline-text-3" id="text-org7725f26">
<p>
Kernel是计算机资源的守护者
</p>
<ul class="org-ul">
<li>当打开计算机时，Kernel总是第一个被启动</li>
<li>Kernel程序只有一个，它维护数据来管理每一个用户空间进程</li>
<li>Kernel同时还维护了大量的数据结构来帮助它管理各种各样的硬件资源，以供用户空间的程序使用</li>
<li><p>
Kernel同时还有大量内置的服务
</p>
<pre class="example" id="org51971b2">
例如，Kernel通常会有文件系统实现类似文件名，文件内容，目录的东西，并理解如何将文件存储在磁盘中

所以用户空间的程序会与Kernel中的文件系统交互，文件系统再与磁盘交互
</pre></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org05dfac3" class="outline-2">
<h2 id="org05dfac3">操作系统的目的</h2>
<div class="outline-text-2" id="text-org05dfac3">
<ul class="org-ul">
<li>在多个应用之间复用硬件</li>
<li>隔离应用程序, 保证安全，彼此错误不会相互影响</li>
<li>允许合作的应用程序之间共享资源</li>
<li>为了可移植性而抽象硬件</li>
<li>提供有用的服务</li>
</ul>
</div>
<div id="outline-container-org1783e81" class="outline-3">
<h3 id="org1783e81">高效vs易用</h3>
<div class="outline-text-3" id="text-org1783e81">
<p>
高效性需要在low-level接近硬件进行操作，而易用性需要提供high-level的可移植接口。因此，实现既简单可移植又高效的接口是个挑战
</p>
</div>
</div>
<div id="outline-container-org67d6903" class="outline-3">
<h3 id="org67d6903">强大vs简单</h3>
<div class="outline-text-3" id="text-org67d6903">
<p>
想要提供强大的操作系统服务来辅助应用程序运行，但又期望其拥有简单的接口以便于程序员理解和使用。目标是提供既简单又功能强大的接口
</p>
</div>
</div>
<div id="outline-container-orgc8d61fe" class="outline-3">
<h3 id="orgc8d61fe">灵活vs安全</h3>
<div class="outline-text-3" id="text-orgc8d61fe">
<p>
内核具备灵活的接口。希望给程序员完全的自由，但是实际上又不能是真正的完全自由，因为不想要程序员能直接访问到硬件，干扰到其他的应用程序，或者干扰操作系统的行为
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
